package cn.lyhxh.exception;

public enum CheckErrorCodeEnum {

    /**
     * E000000 6为错误码:
     * 前两位:模块
     * 中间两位:功能
     * 最后两位:错误代码
     */
    S000101("S000101", "接口错误:参数为空."),
    /********
     * S00 系统
     **********/
    S000001("S000001", "接口错误:系统出错."),
    S000102("S000102", "接口错误:令牌不能为空."),
    S000103("S000103", "用户登录信息无效"),
    /**
     * O01 订单模块
     * 01 支付模块
     * 02 购买模块
     * 03 查询模块
     * 04 修改模块
     */
    O010102("O010102", "支付错误:支付订单号不能为空."),
    O010103("O010103", "支付错误:支付方式不能为空."),
    O010104("O010104", "支付错误:支付方式不正确."),
    O010111("O010111", "支付错误:支付单号不存在."),
    O010112("O010112", "支付错误:支付单不是未支付状态."),

    O010201("O010201", "购买错误:商品ID不能为空."),
    O010202("O010202", "购买错误:商品数量不能为空."),
    O010203("O010203", "购买错误:商品不存在."),
    O010204("O010204", "购买错误:商品已下架."),
    O010205("O010205", "购买错误:商品库存不足."),

    O010206("O010206", "购买错误:收货人名称不能为空."),
    O010207("O010207", "购买错误:收货人电话不能为空."),
    O010208("O010208", "购买错误:收货人地址不能为空."),
    O010209("O010209", "购买错误:商品信息不能为空."),

    O010301("O010301", "查询错误:发货单编码不存在."),
    O010302("O010302", "查询错误:查询快递出错."),
    O010303("O010303", "查询错误:发货单商品不存在."),

    O010401("O010401", "修改错误:订单编号不能为空."),
    O010402("O010402", "修改错误:订单状态不正确."),
    O010403("O010403", "修改错误:该用户没有此订单."),

    O010501("O010501", "修改错误:未查询到发文信息."),
    /**
     * 用户相关异常信息
     */
    U100001("U100001", "该手机号已经注册过，不能重复注册！"),
    U100002("U100002", "短信验证码不正确！"),
    U100003("U100003", "用户名不存在！"),
    U100004("U100004", "用户名或密码错误！"),
    U100005("U100005", "原密码错误！"),
    U100006("U100006", "该手机号已经注册过！"),
    U100007("U100007", "手机号格式不正确！"),
    U100008("U100008", "发送短信已超出限制！"),
    U100009("U100009", "参数不正确！"),
    /**
     * 店铺相关
     * */
    SP100001("SP100001", "店铺信息不存在！"),
    /**
     * 退款相关
     * */
    R100001("R100001", "不能重复申请退款！"),
    R100002("R100002", "退款订单不存在！"),
    R100003("R100003", "订单信息不存在！"),
    R100004("R100004", "退款信息不存在！"),
    R100005("R100005", "退款申请状态异常，无法修改！");

    /**
     * CODE
     */
    private String code;

    /**
     * 描述
     */
    private String desc;

    CheckErrorCodeEnum(String code, String desc) {
        this.code = code;
        this.desc = desc;
    }


    public String getCode() {
        return code;
    }

    public void setCode(String code) {
        this.code = code;
    }

    public String getDesc() {
        return desc;
    }

    public void setDesc(String desc) {
        this.desc = desc;
    }

}
